![Monogram_250x186.png]()

In [ ]:
# Author:  Dr K Clements
# email: kenclements@gwu.edu
# Created Date: 8/8/2024
# Last Modified: 5/30/2025

### **SEAS 6414 Lecture 2 Notebook**

In [2]:
# Loading necessary libraries
import numpy as np
import pandas as pd
import warnings

warnings.filterwarnings("ignore") # Suppress warnings from pandas and numpy

import pdb # For debugging purposes

In [5]:
# A Pandas Series example.  # A Series is a one-dimensional array-like object that can hold any data type.
series_A = pd.Series([1,2,3,4,5])

In [7]:
type(series_A)

pandas.core.series.Series

In [4]:
# A Series can be indexed like a list or an array.
# You can access elements by their index.
series.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
# Creating a Series with custom indices.
series2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [7]:
series2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
# Accessing elements by index label.
print(series2['a'])

-5

In [9]:
# You can access elements by their index location.
series2[0]

np.int64(4)

In [11]:
# Creating a Dictionary to hold state data that we will convert to a Series.
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [12]:
# Conversion is very simple; just pass the dictionary to the Series constructor.
series3 = pd.Series(sdata)

In [13]:
series3.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

In [19]:
# Conversing a Series back to a dictionary is also straightforward.
# The to_dict() method converts the Series back to a dictionary.
sdata2 = series3.to_dict()

In [20]:
sdata2

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [14]:
# DataFrames are also a core data structure in pandas, similar to a table in a database or an Excel spreadsheet.
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df1 = pd.DataFrame(data)

In [15]:
# DataFrames are a collection of Series objects, where each column is a Series.
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
#Loading a CSV file into a DataFrame.
df2 = pd.read_csv('../data/Auto.csv')

In [17]:
# We can inspect the first few rows of the DataFrame using the head() method.
df2.head(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [28]:
# Tailing the DataFrame shows the last few rows.
df2.tail(1)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
396,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [21]:
#Info is a powerful method that provides a concise summary of the DataFrame.  Including the number of non-null entries, data types, and memory usage.
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           397 non-null    float64
 1   cylinders     397 non-null    int64
 2   displacement  397 non-null    float64
 3   horsepower    397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
 9   horsepower1   392 non-null    Int64
dtypes: Int64(1), float64(3), int64(4), object(2)
memory usage: 31.5+ KB

In [19]:
# Convert the 'horsepower' column to numeric, coercing errors to NaN, then convert to integer (nullable Int64 to handle NaNs)
df2['horsepower1'] = pd.to_numeric(df2['horsepower'], errors='coerce').astype('Int64')

In [20]:
df2

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name,horsepower1
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,130
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,165
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,150
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,150
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,140
...,...,...,...,...,...,...,...,...,...,...
392,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,86
393,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,52
394,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,84
395,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,79
396,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,82

In [32]:
# You can access elements by index label.  The column index is used to access columns.
print(df2.mpg)

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [33]:
# Can also access columns using the bracket approch.
print(df2['mpg'])

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [25]:
# Numpy arrays can be used to populate a Series.
# Here we create a Series from a numpy array with custom indices.
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

# the in operator checks if a label exists in the Series index.
'd' in obj.index

False

In [23]:
np.arange(3)

array([0, 1, 2])

In [26]:
#reindex() is used to change the order of the Series index.  This does not change the data, but rather the order of the index labels.
obj.reindex(['c', 'b', 'a'])

c    2
b    1
a    0
dtype: int64

In [27]:
# Notice that the reindexing does not permanently change the Series unless you assign it back to the variable.
obj

a    0
b    1
c    2
dtype: int64

In [31]:
obj1 = obj.reindex(['c', 'a', 'b'])

In [29]:
obj1

c    2
a    0
b    1
dtype: int64

In [43]:
# a new Series can be created by reindexing an existing Series.  Dropping an index label removes it from the Series.
new_obj = obj.drop("c")

In [44]:
new_obj

a    0
b    1
dtype: int64

In [45]:
# We preserved the original Series, obj, and created a new Series, new_obj, without the 'c' index label.
obj

a    0
b    1
c    2
dtype: int64

In [32]:
# inplace = True modifies the original Series in place, removing the specified index label.
new_obj = obj.drop("c", inplace=True)

In [33]:
obj

a    0
b    1
dtype: int64

In [34]:
# Create a DataFrame with 4 columns and 20 rows of random normal data
# randn generates random numbers from a standard normal distribution (mean=0, std=1).
random_df = pd.DataFrame(np.random.randn(20, 4), columns=['A', 'B', 'C', 'D'])
random_df

           A         B         C         D
0   0.239464 -0.436548  2.735388  1.888701
1   0.630921 -0.859817  1.773368  0.423561
2  -0.695264  1.187744 -1.709530 -0.146463
3  -0.251878  0.124330 -0.554440  0.679328
4   0.279926 -0.080509  0.574238 -1.149833
5  -0.077368  0.547773  1.595722  0.021072
6   2.225721  1.274100  0.106386  1.078900
7  -0.702523  0.273032  2.174540 -0.027975
8   1.493980  2.085007 -0.251457  1.372666
9  -0.602571  0.741109 -1.503407 -0.816450
10  0.401283 -0.773796 -0.674759  1.034338
11  0.490911  0.963766  0.433641 -0.775943
12 -1.274085 -1.519587 -0.865340 -0.380768
13 -0.485637  0.345903  0.497260 -0.601937
14 -1.035047 -0.356222 -1.664277 -0.693084
15  0.473926  2.049772  0.027111 -0.406118
16 -0.606984 -0.213301  0.393874  1.930134
17  0.453704  0.134139  0.285296 -0.760575
18  0.183596 -1.433769 -1.254707  1.559931
19  0.112711 -0.159309 -0.392575 -0.191700

In [35]:
# Find rows in random_df where values in column 'C' are within a specific range, e.g., between -1 and 1
random_df.loc[(random_df['C'] >= -1) & (random_df['C'] <= 1)]

           A         B         C         D
3  -0.251878  0.124330 -0.554440  0.679328
4   0.279926 -0.080509  0.574238 -1.149833
6   2.225721  1.274100  0.106386  1.078900
8   1.493980  2.085007 -0.251457  1.372666
10  0.401283 -0.773796 -0.674759  1.034338
11  0.490911  0.963766  0.433641 -0.775943
12 -1.274085 -1.519587 -0.865340 -0.380768
13 -0.485637  0.345903  0.497260 -0.601937
15  0.473926  2.049772  0.027111 -0.406118
16 -0.606984 -0.213301  0.393874  1.930134
17  0.453704  0.134139  0.285296 -0.760575
19  0.112711 -0.159309 -0.392575 -0.191700

In [37]:
# This provides the 5th to 7th rows of the DataFrame, selecting only the last two columns.
random_df.iloc[4:7, 0:2]

          A         B
4  0.279926 -0.080509
5 -0.077368  0.547773
6  2.225721  1.274100

In [55]:
# arange() creates an array of evenly spaced values within a specified range.
# reshape() changes the shape of the array to a specified number of rows and columns.
# passing one method to another allows for chaining operations.
df1 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

In [41]:
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [43]:
# Another dataframe with different data and structure that we will use for merging and joining operations.
df2 =  pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), index=["Ohio", "Texas", "Colorado"])

In [42]:
df2

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name,horsepower1
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,130
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320,165
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite,150
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst,150
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino,140
...,...,...,...,...,...,...,...,...,...,...
392,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl,86
393,44.0,4,97.0,52,2130,24.6,82,2,vw pickup,52
394,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage,84
395,28.0,4,120.0,79,2625,18.6,82,1,ford ranger,79
396,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10,82

In [44]:
c=pd.concat([df1, df2], axis=0, join='outer', ignore_index=False)

In [45]:
c

           state    year  pop    b    c    d
0           Ohio  2000.0  1.5  NaN  NaN  NaN
1           Ohio  2001.0  1.7  NaN  NaN  NaN
2           Ohio  2002.0  3.6  NaN  NaN  NaN
3         Nevada  2001.0  2.4  NaN  NaN  NaN
4         Nevada  2002.0  2.9  NaN  NaN  NaN
5         Nevada  2003.0  3.2  NaN  NaN  NaN
Ohio         NaN     NaN  NaN  0.0  1.0  2.0
Texas        NaN     NaN  NaN  3.0  4.0  5.0
Colorado     NaN     NaN  NaN  6.0  7.0  8.0

In [ ]:
# This will merge df1 and df2 based on their indices.  The result will be a new DataFrame with the union of the indices.
# this preserves all indices from both DataFrames by using suffixes where there is overlap.
# If an index is present in one DataFrame but not the other, the result will have NaN for that index in the missing DataFrame.
merged_df = pd.merge(df1, df2, left_index=True, right_index=True, how='outer', suffixes=('_df1', '_df2'))
merged_df

          b_df1  d_df1     e  b_df2    c  d_df2
Colorado    NaN    NaN   NaN    6.0  7.0    8.0
Ohio        3.0    4.0   5.0    0.0  1.0    2.0
Oregon      9.0   10.0  11.0    NaN  NaN    NaN
Texas       6.0    7.0   8.0    3.0  4.0    5.0
Utah        0.0    1.0   2.0    NaN  NaN    NaN

In [76]:
# Merge df1 and df2 using their indices, keeping only the intersection (inner join)
intersection_merge = pd.merge(df1, df2, left_index=True, right_index=True, how='inner', suffixes=('_df1', '_df2'))
intersection_merge

       b_df1  d_df1    e  b_df2    c  d_df2
Ohio     3.0    4.0  5.0    0.0  1.0    2.0
Texas    6.0    7.0  8.0    3.0  4.0    5.0

In [81]:
# adding two DataFrames with the same indices will result in a new DataFrame with the sum of the corresponding elements.
# where there is no matching index, the result will be NaN (Not a Number).
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [83]:
# passing dataframes to numpy functions will apply the function element-wise.
np.abs(df1 + df2)

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [84]:
def max_val(x):
        return x.max()

In [ ]:
df1

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [85]:
# passing a function to apply() will apply the function to each column of the DataFrame.
df1.apply(max_val)

b     9.0
d    10.0
e    11.0
dtype: float64

In [86]:
# we can also pass the axis parameter to apply() to specify whether to apply the function to rows or columns.
df1.apply(max_val, axis = 1)

Utah       2.0
Ohio       5.0
Texas      8.0
Oregon    11.0
dtype: float64

In [93]:
# sorting a DataFrame by a specific column can be done using the sort_values() method.
# This will sort the DataFrame by column 'b' in descending order.
# sorting by two columns can be done by passing a list of column names to the by parameter.
(df1+df2).sort_values(by = ['b', 'd'], ascending=False)

            b   c     d   e
Texas     9.0 NaN  12.0 NaN
Ohio      3.0 NaN   6.0 NaN
Colorado  NaN NaN   NaN NaN
Oregon    NaN NaN   NaN NaN
Utah      NaN NaN   NaN NaN

In [88]:
#sorting on index values can be done using the sort_index() method.
# This will sort the DataFrame by its index in ascending order.
df2.sort_index(ascending=True)

            b    c    d
Colorado  6.0  7.0  8.0
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0

In [92]:
# sorting by column index values can be done using the sort_index() method with axis=1.
df2.sort_index(axis=1, ascending=False)

            d    c    b
Ohio      2.0  1.0  0.0
Texas     5.0  4.0  3.0
Colorado  8.0  7.0  6.0

In [94]:
# calculating the mean of each column in a DataFrame can be done using the mean() method.
df2.mean(axis=1)

Ohio        1.0
Texas       4.0
Colorado    7.0
dtype: float64

In [95]:
# again the other axis can be specified to calculate the mean across rows or columns.
df2.mean(axis=0)

b    3.0
c    4.0
d    5.0
dtype: float64

In [96]:
df2.std(axis=0)

b    3.0
c    3.0
d    3.0
dtype: float64

In [97]:
# dealing with nan in dataframes is a common task in data analysis.
# NaN (Not a Number) is used to represent missing or undefined values in pandas.
# deleting or imputing NaN values is a common operation in data cleaning.
from sklearn.impute import SimpleImputer

In [98]:
df1

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [99]:
# at is used to set a value at a specific index and column in a DataFrame.
df1.at['Utah', 'd'] = np.nan

In [100]:
df1

          b     d     e
Utah    0.0   NaN   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [101]:
imputer = SimpleImputer(strategy='mean')  # You can also use 'median', 'most_frequent', or 'constant'

In [104]:
# nan in column d will be replaced with the mean of the column.
df1['d'] = imputer.fit_transform(df1[['d']])

In [105]:
df1

          b     d     e
Utah    0.0   7.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [107]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"], "data1": pd.Series(range(7), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "d"], "data2": pd.Series(range(3), dtype="Int64")})

In [108]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [109]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [110]:
# merging on a key column allows for combining data from two DataFrames based on a common column.
# This will perform a left join, keeping all rows from df1 and matching rows from df2.
# The resulting DataFrame will have NaN for data2 where there is no match in df2.
pd.merge(df1, df2, on='key', how='left')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   c      3   <NA>
4   a      4      0
5   a      5      0
6   b      6      1

In [111]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],"key2": ["one", "two", "one"],"lval": pd.Series([1, 2, 3], dtype='Int64')})

right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],"key2": ["one", "one", "one", "two"],"rval": pd.Series([4, 5, 6, 7], dtype='Int64')})

In [112]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [113]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [116]:
# merging with 2 keys allows for combining data from two DataFrames based on multiple columns.
# This will perform an outer join, keeping all rows from both DataFrames and matching rows based on the specified keys.
combo = pd.merge(left, right, on=['key1','key2'], how='outer')

In [117]:
combo

  key1 key2  lval  rval
0  bar  one     3     6
1  bar  two  <NA>     7
2  foo  one     1     4
3  foo  one     1     5
4  foo  two     2  <NA>

In [118]:
# concat is different from merge in that it concatenates DataFrames along a particular axis.
# It can be used to stack DataFrames vertically or horizontally.
pd.concat([left, right], axis=0)

  key1 key2  lval  rval
0  foo  one     1  <NA>
1  foo  two     2  <NA>
2  bar  one     3  <NA>
0  foo  one  <NA>     4
1  foo  one  <NA>     5
2  bar  one  <NA>     6
3  bar  two  <NA>     7

In [126]:
# to reindex the concatenated DataFrame, you can use the ignore_index parameter.
combo1 = pd.concat([left, right], axis=0, ignore_index=True)
combo1

  key1 key2  lval  rval
0  foo  one     1  <NA>
1  foo  two     2  <NA>
2  bar  one     3  <NA>
3  foo  one  <NA>     4
4  foo  one  <NA>     5
5  bar  one  <NA>     6
6  bar  two  <NA>     7

In [121]:
# to add a new column to the concatenated DataFrame, you can use the keys parameter.
# this is similar to groupby, where each DataFrame is assigned a key.
pd.concat([left, right], axis=0, keys=['left', 'right'])

        key1 key2  lval  rval
left  0  foo  one     1  <NA>
      1  foo  two     2  <NA>
      2  bar  one     3  <NA>
right 0  foo  one  <NA>     4
      1  foo  one  <NA>     5
      2  bar  one  <NA>     6
      3  bar  two  <NA>     7

In [128]:
grouped = combo1.groupby('key1')

In [131]:
grouped.get_group('foo')

  key1 key2  lval  rval
0  foo  one     1  <NA>
1  foo  two     2  <NA>
3  foo  one  <NA>     4
4  foo  one  <NA>     5

In [136]:
grouped.get_group('bar').head(2)

  key1 key2  lval  rval
2  bar  one     3  <NA>
5  bar  one  <NA>     6

In [137]:
grouped.ngroups

2

In [138]:
from sklearn.datasets import load_iris
import pandas as pd

In [139]:
iris = load_iris()

df_iris = pd.DataFrame(data=iris.data, columns=iris.feature_names)

# Add the target column
df_iris['species'] = iris.target

In [140]:
df_iris

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,2
146,6.3,2.5,5.0,1.9,2
147,6.5,3.0,5.2,2.0,2
148,6.2,3.4,5.4,2.3,2
149,5.9,3.0,5.1,1.8,2

In [143]:
# to perform a train-test split, we can use the train_test_split function from sklearn.
from sklearn.model_selection import train_test_split

In [144]:
# we will split the DataFrame into training and testing sets.  30% of the data will be used for testing, and the rest for training.
# The random_state parameter ensures that the split is reproducible.
# ensure we split before any further processing to maintain the integrity of the data.
df_train, df_test = train_test_split(df_iris, test_size=0.3, random_state=42)

In [146]:
#scaling data is a common preprocessing step in machine learning.
# it puts the data on a similar scale, which can improve the performance of many algorithms.
from sklearn.preprocessing import StandardScaler, MinMaxScaler

In [147]:
# StadardScaler standardizes features by removing the mean and scaling to unit variance.
# MinMaxScaler scales features to a given range, typically between 0 and 1.
scaler = StandardScaler()  # Use MinMaxScaler() for normalization between 0 and 1

# Fit the scaler to the training data and transform it
# This will compute the mean and standard deviation for each feature in the training set.
df_train_scaled = scaler.fit_transform(df_train)

# Apply the same transformation to the test data
# NEVER fit the scaler to the test data, as this would introduce data leakage.
df_test_scaled = scaler.transform(df_test)

In [148]:
df_test

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
73,6.1,2.8,4.7,1.2,1
18,5.7,3.8,1.7,0.3,0
118,7.7,2.6,6.9,2.3,2
78,6.0,2.9,4.5,1.5,1
76,6.8,2.8,4.8,1.4,1
31,5.4,3.4,1.5,0.4,0
64,5.6,2.9,3.6,1.3,1
141,6.9,3.1,5.1,2.3,2
68,6.2,2.2,4.5,1.5,1
82,5.8,2.7,3.9,1.2,1
110,6.5,3.2,5.1,2.0,2
12,4.8,3.0,1.4,0.1,0
36,5.5,3.5,1.3,0.2,0
9,4.9,3.1,1.5,0.1,0
19,5.1,3.8,1.5,0.3,0
56,6.3,3.3,4.7,1.6,1
104,6.5,3.0,5.8,2.2,2
69,5.6,2.5,3.9,1.1,1
55,5.7,2.8,4.5,1.3,1
132,6.4,2.8,5.6,2.2,2
29,4.7,3.2,1.6,0.2,0
127,6.1,3.0,4.9,1.8,2
26,5.0,3.4,1.6,0.4,0
128,6.4,2.8,5.6,2.1,2
131,7.9,3.8,6.4,2.0,2
145,6.7,3.0,5.2,2.3,2
108,6.7,2.5,5.8,1.8,2
143,6.8,3.2,5.9,2.3,2
45,4.8,3.0,1.4,0.3,0
30,4.8,3.1,1.6,0.2,0
22,4.6,3.6,1.0,0.2,0
15,5.7,4.4,1.5,0.4,0
65,6.7,3.1,4.4,1.4,1
11,4.8,3.4,1.6,0.2,0
42,4.4,3.2,1.3,0.2,0
146,6.3,2.5,5.0,1.9,2
51,6.4,3.2,4.5,1.5,1
27,5.2,3.5,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
32,5.2,4.1,1.5,0.1,0
142,5.8,2.7,5.1,1.9,2
85,6.0,3.4,4.5,1.6,1
86,6.7,3.1,4.7,1.5,1
16,5.4,3.9,1.3,0.4,0
10,5.4,3.7,1.5,0.2,0

In [ ]:
df_test_scaled

array([[ 0.3100623 , -0.50256349,  0.484213  , -0.05282593, -0.07118685],
       [-0.17225683,  1.89603497, -1.26695916, -1.27039917, -1.31695672],
       [ 2.23933883, -0.98228318,  1.76840592,  1.43531914,  1.17458302],
       [ 0.18948252, -0.26270364,  0.36746819,  0.35303182, -0.07118685],
       [ 1.15412078, -0.50256349,  0.54258541,  0.2177459 , -0.07118685],
       [-0.53399618,  0.93659559, -1.38370397, -1.13511325, -1.31695672],
       [-0.29283662, -0.26270364, -0.15788346,  0.08245999, -0.07118685],
       [ 1.27470056,  0.21701605,  0.71770262,  1.43531914,  1.17458302],
       [ 0.43064208, -1.94172256,  0.36746819,  0.35303182, -0.07118685],
       [-0.05167705, -0.74242333,  0.01723376, -0.05282593, -0.07118685],
       [ 0.79238143,  0.4568759 ,  0.71770262,  1.0294614 ,  1.17458302],
       [-1.25747488, -0.02284379, -1.44207638, -1.540971  , -1.31695672],
       [-0.4134164 ,  1.17645543, -1.50044878, -1.40568508, -1.31695672],
       [-1.1368951 ,  0.21701605, -1.38370397, -1.540971  , -1.31695672],
       [-0.89573553,  1.89603497, -1.38370397, -1.27039917, -1.31695672],
       [ 0.55122187,  0.69673574,  0.484213  ,  0.48831773, -0.07118685],
       [ 0.79238143, -0.02284379,  1.12630946,  1.30003323,  1.17458302],
       [-0.29283662, -1.22214302,  0.01723376, -0.18811184, -0.07118685],
       [-0.17225683, -0.50256349,  0.36746819,  0.08245999, -0.07118685],
       [ 0.67180165, -0.50256349,  1.00956465,  1.30003323,  1.17458302],
       [-1.37805466,  0.4568759 , -1.32533157, -1.40568508, -1.31695672],
       [ 0.3100623 , -0.02284379,  0.60095781,  0.75888956,  1.17458302],
       [-1.01631531,  0.93659559, -1.32533157, -1.13511325, -1.31695672],
       [ 0.67180165, -0.50256349,  1.00956465,  1.16474731,  1.17458302],
       [ 2.4804984 ,  1.89603497,  1.47654389,  1.0294614 ,  1.17458302],
       [ 1.033541  , -0.02284379,  0.77607503,  1.43531914,  1.17458302],
       [ 1.033541  , -1.22214302,  1.12630946,  0.75888956,  1.17458302],
       [ 1.15412078,  0.4568759 ,  1.18468187,  1.43531914,  1.17458302],
       [-1.25747488, -0.02284379, -1.44207638, -1.27039917, -1.31695672],
       [-1.25747488,  0.21701605, -1.32533157, -1.40568508, -1.31695672],
       [-1.49863445,  1.41631528, -1.675566  , -1.40568508, -1.31695672],
       [-0.17225683,  3.33519404, -1.38370397, -1.13511325, -1.31695672],
       [ 1.033541  ,  0.21701605,  0.30909579,  0.2177459 , -0.07118685],
       [-1.25747488,  0.93659559, -1.32533157, -1.40568508, -1.31695672],
       [-1.73979401,  0.4568759 , -1.50044878, -1.40568508, -1.31695672],
       [ 0.55122187, -1.22214302,  0.65933022,  0.89417548,  1.17458302],
       [ 0.67180165,  0.4568759 ,  0.36746819,  0.35303182, -0.07118685],
       [-0.77515575,  1.17645543, -1.38370397, -1.40568508, -1.31695672],
       [-1.01631531,  1.41631528, -1.44207638, -1.40568508, -1.31695672],
       [-0.77515575,  2.6156145 , -1.38370397, -1.540971  , -1.31695672],
       [-0.05167705, -0.74242333,  0.71770262,  0.89417548,  1.17458302],
       [ 0.18948252,  0.93659559,  0.36746819,  0.48831773, -0.07118685],
       [ 1.033541  ,  0.21701605,  0.484213  ,  0.35303182, -0.07118685],
       [-0.53399618,  2.13589481, -1.50044878, -1.13511325, -1.31695672],
       [-0.53399618,  1.65617512, -1.38370397, -1.40568508, -1.31695672]])

In [ ]:
data = np.array([[[1.5, -0.1, 3], [0, -3, 6.5], [0, -3, 6.5]],[[1.5, -0.1, 3], [0, -3, 6.5], [0, -3, 6.5]]])

In [ ]:
data

array([[[ 1.5, -0.1,  3. ],
        [ 0. , -3. ,  6.5],
        [ 0. , -3. ,  6.5]],

       [[ 1.5, -0.1,  3. ],
        [ 0. , -3. ,  6.5],
        [ 0. , -3. ,  6.5]]])

In [ ]:
data.shape

(2, 3, 3)

In [ ]:
data.ndim

3

In [ ]:
np.dot(data, data)

array([[[[  2.25,  -8.85,  23.35],
         [  2.25,  -8.85,  23.35]],

        [[  0.  , -10.5 ,  22.75],
         [  0.  , -10.5 ,  22.75]],

        [[  0.  , -10.5 ,  22.75],
         [  0.  , -10.5 ,  22.75]]],


       [[[  2.25,  -8.85,  23.35],
         [  2.25,  -8.85,  23.35]],

        [[  0.  , -10.5 ,  22.75],
         [  0.  , -10.5 ,  22.75]],

        [[  0.  , -10.5 ,  22.75],
         [  0.  , -10.5 ,  22.75]]]])

In [ ]:
np.zeros(10)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [ ]:
np.zeros((10,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [ ]:
np.empty((10,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [ ]:
df_id = np.identity(5)

In [ ]:
df_id

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

In [ ]:
df_id[:,:3]

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 0., 0.],
       [0., 0., 0.]])